//NedoRPG. PoStMoDeRn edition.
// 2024-2024. Жду 2228, чьтобы по ржать. (Цыфровые археологи, если вы читаете этот комментарий, желаю вам умереть от ПоНоСа)))))
//Все права (и лева) не защищены, копипастите смело (только учтите, ваш проэкт может умереть насмерть от говнокода...)
//Коммуниз подебит


#include <ctime>
#include <iostream>
#include <cstdlib>

using namespace std;

char q0;
char q1;
char q2;
char q3;
char q4;
char q5;
char q6;
char q7;
char q8;
char q9;
char q10;
char q11;
char q12;
char q13;
char q14;
char q15;
char q16;
char q17;
char q18;
char q19;
char q20;
char q21;
char q22;
char q23;
char q24;
char q25;
char q26;
char q27;
char q28;
char q29;
char q30;
char q31;
char q32;
char q33;
char q34;
char q35;
char q36;
char q37;
char q38;
char q39;
char q40;
char q41;
char q42;
char q43;
char q44;
char q45;
char q46;
char q47;
char q48;
char q49;
char q50;
char q51;
char q52;
char q53;
char q54;
char q55;
char q56;
char q57;
char q58;
char q59;
char q60;
char q61;
char q62;
char q63;
char q64;
char q65;
char q66;
char q67;
char q68;


char anasha0;
char anasha1;

char trax0;
char trax1;

char lagushkaASK;

int NePov = 0;
int OscBlag = 0;
int boompalka = 0;

int EIQPDHKLQSKJHWFJK = 1;

int costil0 = 1; //ммм костыли...
int costil1 = 1; //ммм костыли...
int costil2 = 1; //ммм костыли...
int costil3 = 0; //ммм костыли...

//они кста ниначе не влияют. ахахахах?

int money = 100;
int lvl = 1;

void func68() {
    cout << "Вы видите Постмодерн. Хотите трахнуть коня? (y/n)\n";
    cin >> q68;
    if (q68 == 'y') {
        cout << "Конь трахнул вас. Постмодерн победил...\n";
        system("pause");
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else if (q68 == 'n') {
        cout << "Блять я не знаю как это комментировать...\n";
        system("pause");
        cout << "СмЕшНо же)))))\n";
        system("pause");
        cout << "ПОШЕЛ В ПИЗДУ ПОШЕЛ В ПИЗДУ ПОШЕЛ В ПИЗДУ\n";
        system("pause");
        cout << "))))))\n";
        system("pause");
        cout << "Вы умерли насмерть.\n";
        system("pause");
        cout << "АХАХАХАХ ЗДОРОВО Я ВАС НАЕБАЛ, ДА??? АХАХАХАХ)))))))\n";
        system("pause");
        cout << "блять.....\n";
        system("pause");
    }
    else {
        exit(0);
    }
}
void func67() {
    cout << "Хотите немного пресс качат и отжумания? (y/n)\n";
    cin >> q67;
    if (q67 == 'y') {
        cout << "Вы порвали МЫЩЬцу пиписьки\n";
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else if (q67 == 'n') {
        cout << "Слава Россссии. + 14 опыта, + 88 ГКБ...\n";
        lvl = lvl + 14;
        money = money + 88;
    }
    else {
        exit(0);
    }
}
void func66() {
    cout << "Вы видите милого котёнка. Погладить? (y/n)\n";
    int A3 = 0;
    int B3 = 1;
    int X3 = 0;
    X3 = A3 + rand() % ((B3 + 1) - A3);
    cin >> q66;

    if (q66 == 'y' && X3 == 0) {
        cout << "Вам отрезали залупу...\n";
        system("pause");
        cout << "Ладно...\n";
        system("pause");
    }
    if (q66 == 'y' && X3 == 1) {
        cout << "Вас телепортировало на секретную базу нацистов иа пришили 13 членов.\n";
        system("pause");
        cout << "Они встают при heil hitler...\n";
        system("pause");
    }
    else if (q66 == 'n' && X3 == 0) {
        cout << "Вам поцарапали пенис\n";
        system("pause");
        cout << "Вам понравилось...\n";
        system("pause");
    }
    else if (q66 == 'n' && X3 == 0) {
        cout << "Вам поцарапали пенис\n";
        system("pause");
        cout << "Вы умерли от заражения крови.\n";
        system("pause");
        cout << "Вас воскресил призрак коммунизма. Зачем? Хуй его знает...\n";

    }
    else {
        exit(0);
    }
}
void func65() {
    cout << "Бинауарный BeGeMoTT просит достать ему glaza из РеЧкИ (Они glaza). Достать glaza? (y/n)\n";
    cin >> q65;
    if (q65 == 'y') {
        cout << "Вы оbre4enы\n";
        system("pause");
        exit(0);
    }
    else if (q65 == 'n') {
        cout << "Вы оbre4enы\n";
        system("pause");
        cout << "Ахахахах я пошутил.\n";
        system("pause");
        cout << "Смешно, да???\n";
        system("pause");

    }
    else {
        exit(0);
    }
}
void func64() {
    cout << "Вы хотите срать. Хотите посрать? (y/n)\n";
    cin >> q64;
    if (q64 == 'y') {
        cout << "У вас украли говно. Возможно это был продавец говна...\n";
        system("pause");
        cout << "Предмет потерян: говно.\n";
        system("pause");
    }
    else if (q64 == 'n') {
        cout << "Вы умерли от разрыва прямой кишки...\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}


void func63() {
    cout << "Вы увидели камеру для суецыда. Всего за 25 ГКБ вы можете самоубица смертельно насмерть. Хотите? (y/n)\n";
    cin >> q63;
    if (q63 == 'y' && money >= 25) {
        cout << "Вы счастливы...\n";
        system("pause");
        cout << "Вы умерли...\n";
        system("pause");
        exit(0);
    }
    else if (q63 == 'y' && money < 25) {
        cout << "У вас не хватает денег, чьтобы самоубица. Обидно. Ряльно...\n";
    }
    else if (q63 == 'n') {
        cout << "Ок boomer... Фильм говно кста... Даже в озвучке гоблина...\n";
    }
    else {
        exit(0);
    }
}
void func62() {
    cout << "Хотите посасать хуй? (y/n)\n";
    cin >> q62;
    if (q62 == 'y') {
        cout << "Вы ... блять, я не буду это комментировать... сука... блять...\n";
        system("pause");
        cout << "+ 8 к драгоценному жизненному опыту... блять...\n";
        system("pause");
        lvl = lvl + 8;
    }
    else if (q62 == 'n') {
        cout << "Это уже не постмодерн, это ебанина какая-то... Аффтар, ты ебанутый блять? ЧОЧО УПЯЧКА ПЛЫВЯЧКА ПЛЫВЯЧКА. \n";
    }
    else {
        exit(0);
    }
}
void func61() {
    cout << "Вы видите максимку. По ржать вместе с ним? (y/n)\n";
    cin >> q61;
    if (q61 == 'y') {
        cout << "Вы по ржали, жОско. + 3 к драгоценному жизненному опыту...\n";
        lvl = lvl + 3;
    }
    else if (q61 == 'n') {
        cout << "Вас разрезала пополам огромная вагина.\n";
        system("pause");
        cout << "Вы мертвы.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func60() {
    cout << "Вы видите работающий двигатель ROTAX 912. Хотите засунуть в него хуй? (y/n)\n";
    int A3 = 0;
    int B3 = 1;
    int X3 = 0;
    X3 = A3 + rand() % ((B3 + 1) - A3);
    cin >> q60;

    if (q60 == 'y' && X3 == 0) {
        cout << "Вам оторвало хуй.\n";
        system("pause");
        cout << "Вы мертвы.\n";
        system("pause");
        exit(0);
    }
    if (q60 == 'y' && X3 == 1) {
        cout << "Вы остановили вал двигателя своим мощным членом.\n";
        system("pause");
        cout << "Вы продали остатки ротакса на базаре и получили по жопе...\n";
        system("pause");
        cout << "Вас ограбили пластелинцы...\n";
        system("pause");
        money = money / 2;
    }
    else if (q60 == 'n') {
        cout << "Это уже не постмодерн, это ебанина какая-то...\n";
    }
    else {
        exit(0);
    }
}

void func59() {
    cout << "Вы видите себя в зеркало. Хотите проткнуть себя? (y/n)\n";
    int A2 = 0;
    int B2 = 1;
    int X2 = 0;
    X2 = A2 + rand() % ((B2 + 1) - A2);
    cin >> q59;

    if (q59 == 'y' && X2 == 0) {
        cout << "Вы проткнули себя. Насмерть...\n";
        system("pause");
        cout << "Вы мертвы.\n";
        system("pause");
        exit(0);
    }
    if (q59 == 'y' && X2 == 1) {
        cout << "Вы проткнули зеркало своим титановым членом.\n";
        system("pause");
        cout << "Вам понравилось...\n";
    }
    else if (q59 == 'n') {
        cout << "Я запутался в слоях иронии, помогите...\n";
    }
    else {
        exit(0);
    }
}
void func58() {
    cout << " Вы пришли на вечеринку в компанию Nvidia по случаю выпуска новой видеокарты GT7900GX2. Вам нравится эта вечеринка? (y/n)\n";
    cin >> q58;
    if (q58 == 'y') {
        cout << "Вы по кушали пиццу с ананасами и ушли.\n";
        system("pause");
        cout << "Вас изнасиловал наемный убийца компании AMD, с помощью Xd 2900 XT\n";
        system("pause");
        exit(0);
    }
    else if (q58 == 'n') {
        cout << "ЧУВАК ЭТА ВЕЧЕРИНКА ГОВНО. Я БЛЯ НЕНАВИЖУ ЭТИХ ЛЮДЕЙ.\n";
        cout << "Вы расстреляли всех на вечеринке. + 5 (минут славы) к опыту\n";
        lvl = lvl + 5;
    }
    else {
        exit(0);
    }
}
void func57() {
    cout << "Человек с тремя глазами на пенисе спрашивает вас: вы любите розы? (y/n)\n";
    int A1 = 0;
    int B1 = 1;
    int X1 = 0;
    X1 = A1 + rand() % ((B1+ 1) - A1);
    cin >> q57;

    if (q57 == 'y' && X1 == 0) {
        cout << "Вас оттрахал в попенгаген полупрозрачный поллитровый хуй.\n";
        system("pause");
        cout << "Вы мертвы.\n";
        system("pause");
        exit(0);
    }
    if (q57 == 'y' && X1 == 1) {
        cout << "Вас оттарабанил в попенгаген полупрозрачный поллитровый хуй.\n";
        system("pause");
        cout << "Вам понравилось...\n";
    }
    else if (q57 == 'n') {
        cout << "Вас ограбили раки..\n";
        money = money - money;
    }
    else {
        exit(0);
    }
}
void func56() {
    cout << "Вы видите пещеру, вход в которую напоминает ваш мощный и накаченный попец.\n";
    cout << "Хотите зайти (y/n)\n";
    cin >> q56;
    if (q56 == 'y') {
        cout << "Вам порвали очько и отрезали хуй...\n";
        system("pause");
        exit(0);
    }
    else if (q56 == 'n') {
        cout << "Вы нашли шприц с героином и продали его на ближайшем чОрном рынке\n";
        money = money + 420;
    }
    else {
        exit(0);
    }
}
void func55() {
    cout << "Вы нашли огромный фиолетовый фаллоимитатор из АБС пластика. Хотите засунуть его себе в жопу? (y/n)\n";
    cin >> q55;
    if (q55 == 'y' && lvl <= 100) {
        cout << "Вы порвали себе анус.\n";
        system("pause");
        cout << "Глупая смерть, не так ли?\n";
        system("pause");
        exit(0);
    }
    else if (q55 == 'y' && lvl >= 100) {
        cout << "Вы преобрели уникальный жизненный опыт...\n";
        lvl = lvl + 8;
    }
    else if (q55 == 'n') {
        cout << "@Разработчик пидорас.\n";
        system("pause");
        cout << "@А я и не отрицал)))\n";
        system("pause");     
        cout << "@Блять...\n";
        system("pause");
    }
    else {
        exit(0);
    }
}
void func54() {
    cout << "Вы встречаете создателя этой этого электронного развлекательного проекта.\n";
    system("pause");
    cout << "Послать его нахуй? (y/n)\n";
    cin >> q54;
    if (q54 == 'y') {
        cout << "Ну и правильно...\n";
        system("pause");
        cout << "Гачимучи гуси дали вам Three hundred bucks.\n";
        money = money + 300;
    }
    else if (q54 == 'n') {
        cout << "Вам прочистили попец огромным спидозным членом.\n";
        cout << "Вы умерли от СПИДа\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}

void func53() {
    cout << "Вы нашли 5 денег. Ижевск...\n";
    system("pause");
    cout << "Покер факе...\n";
    system("pause");
    money = money + 5;
   
}
void func52() {
    cout << "Вы видите ЯК-52. Хотите вывести его на сверхзвук? (y/n)\n";
    cin >> q52;
    if (q52 == 'y' && lvl <= 152) {
        cout << "Вы умерли от перегрузок...\n";
        system("pause");
        if (lvl >= 52) {
        cout << "Вас воскресил призрак коммунизма. Зачем? Хуй его знает...\n";
        system("pause");
        cout << "Призрак коммунизма дал вам немного денег и опыта. Зачем? Хуй его знает... + 228 денег и + 34 к драгоценному жизненному опыту...\n";
        lvl = lvl + 34;
        money = money + 228;
        system("pause");
        }
        else {
            cout << "Вы типа умерли... Всё, игра окончена. Гей овер (Gay jerking off), так сказать... \n";
            system("pause");
            exit(0);
        }
    }
    else if (q52 == 'y' && lvl >= 152) {
        cout << "Вы успешно вывели ЯК-52 на сверхзвук и долетели до Дракона Энтропии\n";
        system("pause");
        cout << "Вы видите Дракона Энтропии. Он похож на пенис. Почему? Хуй его знает, наверное всё так и должно быть. Пути постмодерна как правило крайне дегенеративны, но очень ржечны.\n ";
        system("pause");
        cout << "Вы протаранили Дракона Энтропии с помощью ЯК-52. Он умер насмерть. Вы подебили...\n ";
        system("pause");
        cout << "Это типа хорошая концовка, а главное ржечьная...\n ";
        system("pause");
        exit(0);

    }
    
    else if (q52 == 'n') {
        cout << "Залманыч недоволен вами...\n";
        system("pause");
    }
    else {
        exit(0);
    }
}
void func51() {
    cout << "Внимание анекдот:\n";
    system("pause");
    cout << "Идет медведь по лесу.\n";
    system("pause");
    cout << "Видит: машина горит.\n";
    system("pause");
    cout << "Сел в неё и...\n";
    system("pause");
    if (lvl >= 100) {
        cout << "СГОРЕЛ АХАХАХАХАХАХАХАХ\n"; //смечно
    }
    else {
        cout << "Тебя отымели в сраку, чьмо тупое...\n"; //не смечно
    }

}
void func50() {
    cout << "В вашу жопу засунули хуй. Вопросы? (y/n)\n";
    cin >> q50;
    if (q50 == 'y') {
        cout << " Вас затрахали досмерти...\n";
        system("pause");
        exit(0);
    }
    else if (q50 == 'n') {
        cout << "Вас оттарабанили в попец и дали 5 денег.\n";
        money = money + 5;
    }
    else {
        exit(0);
    }
}
void func49() {
    cout << "Вы видите Владимира. Хотите накурить его анашой, убить, изнасиловать, расчленить и заставить писать ботов на питоне? (y/n)\n";
    cin >> q49;
    if (q49 == 'y') {
        cout << "Вы накурили Владимира, убили, изнасиловали, расчленили и заставили писать ботов на питоне. + 14 очьков к драгоценному жизненному опыту.\n";
        lvl = lvl + 27;

    }
    else if (q49 == 'n') {
        cout << "Вы просто убили и препарировали Владимира. Какой же вы скучный...\n";
    }
    else {
        exit(0);
    }
}
void func48() {
    cout << "Вы видите С В Е К Л О. По ржать? (y/n)\n";
    cin >> q48;
    if (q48 == 'y') {
        cout << "Вы по ржали, жОско.\n";
    }
    else if (q48 == 'n') {
        cout << "Вам порвали анальное отверстие жОские РжЕцЫ\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func47() {
    cout << "Вы видите два стула, один деревянный, другой стальной. Хотите накормить их наркотиками? (y/n)\n";
    cin >> q47;
    if (q47 == 'y') {
        cout << "На деревянный стул сел медведь и сгорел, а стальной стул умер от передоза. + 27 к драгоценному жизненному опыту.\n";
    }
    else if (q47 == 'n') {
        cout << "Ты ебанутый? Иди лечись.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func46() {
    cout << "Ммм. Мм? (y/n)\n";
    cin >> q46;
    if (q46 == 'y') {
        cout << "Вам засунули раскалённую кочергу в зад и провернули 69 раз. Вы умерли насмерть. \n";
        system("pause");
        exit(0);
    }
    else if (q46 == 'n') {
        cout << "Вам дали 333 денег.\n";
        money = money + 333;
    }
    else {
        exit(0);
    }
}
void func45() {
    cout << "Вы зашли в чей то зад. Хотите выйти? (y/n)\n";
    cin >> q45;
    if (q45 == 'y') {
        cout << "Вы нашли сигарету из анаши, закурили и повысили свой опыт на 5 очьков.\n";
        lvl = lvl + 5;
        
    }
    else if (q45 == 'n') {
        cout << "Жопа откусила ваш хуй. Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func44() {
    cout << "Вы повстречали продавца говна. Он предлагает купить у него говно за 10 ГКБ (y/n)\n";
    cin >> q44;
    if (q44 == 'y' && money >= 10) {
        cout << "Вы счастливы\n";
        money = money - 10;
    }
    else if (q44 == 'y' && money < 10) {
        cout << "У вас не хватает денег, чьтобы купить говно. Ебать вы нищеброд.\n";
    }
    else if (q44 == 'n') {
        cout << "Нахуя мне говно? Аффтар, убейся апп стенку...\n";
    }
    else {
        exit(0);
    }
}
void func43() {
    cout << "Вы нашли камень с технологическим отверстием. Хотите сунуть в него свой хуй? (y/n)\n";
    cin >> q43;
    if (q43 == 'y') {
        cout << "Вы отдохнули и преобрели уникальный жизненный опыт. \n";
        lvl = lvl + 20;
    }
    else if (q43 == 'n') {
        cout << "Вас отымела в попенгаген микросхема ОЗУ К565РУ5. Это не смертельно, но крайне позорно... \n";
    }
    else {
        exit(0);
    }
}
void func42() {
    cout << "Вы встретили Пахома. Пахом торгует трахуном за 39 ГКБ. Хотите купить трахун? (y/n)\n";
    cin >> q42;
    if (q42 == 'y') {
        cout << "Вы купили трахун и выпили его. Хотите купить ещё? (y/n)\n";
        money = money - 39;
        cin >> trax0;
        if (trax0 == 'y') {
            cout << "Вы купили трахун и выпили его. Хотите купить ещё? (y/n)\n";
            money = money - 39;
            cin >> trax1;
            if (trax1 == 'y') {
                cout << "Вы умерли от поноса.\n";
                system("pause");
                cout << "Вас воскресил призрак коммунизма. Зачем? Хуй его знает...\n";
                cout << "Призрак коммунизма дал вам денег. Зачем? Хуй его знает...\n";
                money = money + 200;


            }
            else if (trax1 == 'n') {
                cout << "Вас насилуют. Это никак не связано с Пахомом, просто так получилось\n";
                system("pause");
                cout << "Вам порвали прямую кишку. Вы умерли насмерть.\n";
                system("pause");
                exit(0);
            }

        }
        else if (trax0 == 'n') {
            cout << "Вас насилуют. Это никак не связано с Пахомом, просто так получилось\n";
            system("pause");
            cout << "Вам порвали прямую кишку. Вы умерли насмерть.\n";
            system("pause");
            exit(0);
        }
    }
    else if (q42 == 'n') {
        cout << "Вас насилуют. Это никак не связано с Пахомом, просто так получилось\n";
        system("pause");
        cout << "Вам порвали прямую кишку. Вы умерли насмерть.\n";
        system("pause");
        exit(0);

    }
    else {
        exit(0);
    }
}
void func41() {
    cout << "Вы видите Bober. Вы точно этого хотите? (y/n)\n";
    cin >> q41;
    if (q41 == 'y') {
        cout << "— JA PIERDOLĘ, PATRZCIE CO SPOTKAŁEM. BÓBR, KURWA! JA PIERDOLĘ, JAKIE BYDLĘ! BOBER! EJ, KURWA, BOBER! BOBER, NIE SPIERDALAJ, MORDO! CHODŹ TU, KURWO, DO MNIE, BOBER! ALE JESTEŚ, KURWA, DUŻY, TY! BOBEEER! JA PIERDOLĘ, PIERWSZY RAZ W ŻYCIU WIDZĘ BOBRA! JAKIE BYDLĘ JEBANE, SPIERDOLIŁ DO WODY I SIĘ UTOPIŁ! — SKURWYSYNIE, BOBRZE, O TY CHUJU, BOBRZE, A, KURWA, BOBER, HAAAAA, CHUJU!AH!CHUJU, BOBRZE!\n";
    }
    else if (q41 == 'n') {
        cout << "Ваша срака была уничтожена...\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func40() {
    cout << "Вы нашли огнетушитель. Хотите засунуть шланг в рот и нажать на курок? (y/n)\n";
    cin >> q40;
    if (q40 == 'y') {
        cout << "Огнетушитель превратился в пивную кегу, которая дала вам 20 денег...\n";
         money = money + 20;
    }
    else if (q40 == 'n') {
        cout << "Огнетушитель привратился в 20 дюймовый дюралевый фаллос и отымел вас в сраку\n";
        system("pause");
        cout << "Вы умерли от разрыва Очька.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func39() {
    cout << "Вы видите перед собой ж___щну. Хотите потрогать? (y/n)\n";
    cin >> q39;
    if (q39 == 'y' && lvl <= 100) {
        cout << "Вам оторвали хуй и порвали четвертый глаз...\n";
        system("pause");
        exit(0);
    }
    else if (q39 == 'y' && lvl >= 100) {
        cout << "Вы засунули в ж___щну руку и достали z80, управляющий её передатчиком, который в продали на ближайшем радиорынке. + 300 ГКБ.\n";
        money = money + 300;
    }
    else if (q39 == 'n') {
        cout << "ЭТО ГОЛОГРАММА!!! +5 к драгоценному жизненному опыту.\n";
        lvl = lvl + 5;
    }
    else {
        exit(0);
    }
}
void func38() {
    cout << "Вас атакует Негр (1штук). Желаете сражаться? (y/n)\n";
    cin >> q38;
    if (q38 == 'y') {
        cout << "Вы убили Негра (1штук).\n";
        cout << "+ 10 к драгоценному жизненному опыту.\n";
        lvl = lvl + 10;
        
    }
    else if (q38 == 'n') {
        cout << "Негр отымел вас своим мощным микропроцессором ryzen 7 7800x3d\n";
        cout << "Вы умерли насмерть...\n";
        system("pause");
        exit(0);
        
    }
    else {
        exit(0);
    }
}
void func37() {
    cout << "Вы видите мудрую лягущь, которая познала вечное...\n";
    cout << "Хотите спросить её, как вам поступить дальше? (y/n)\n";
    cin >> q37;
    if (q37 == 'y' && lvl >= 100) {
        cout << "Лягущь спрашивает тебя, как ты хочешь завершить свой путь:\n";
        system("pause");
        cout << "1. Хочу, чтобы меня помнили.\n";
        cout << "2. Хочу стать вечным.\n";
        cout << "3. Хочу умереть как герой. \n";
        cout << "4. Хочу стать лягущькой.\n";
        cout << "5. Хочу построить коммуниз.\n";
        cout << "6. Хочу оБнУлИтЬся.\n";
        cout << "7. Хочу отыметь Айн Ренд.\n";
        cout << "8. Хочу По ржать.\n";
        cin >> lagushkaASK;
        if (lagushkaASK == '1') {
            cout << "Тебе нужно оружие и Благословение мудрейшего c1-73...\n";
        }
        else if (lagushkaASK == '2') {
            cout << "Тебе нужна Сила Невского и Благословение...\n";
        }
        else if (lagushkaASK == '3') {
            cout << "Тебе нужна Сила...\n";
        }
        else if (lagushkaASK == '4') {
            cout << "Спроси Ленина...\n";
        }
        else if (lagushkaASK == '5') {
            cout << "Тебе нужны три великих компонента: Сила, Благословение и БУМПАЛКА... \n";
        }
        else if (lagushkaASK == '6') {
            cout << "Иди нахуй быдло, пидор ебаный... \n";
            cout << "Вас отпиздили и отымели...\n";
            money = money - money;
            lvl = lvl - lvl;
            NePov = 0;
            boompalka = 0;
            OscBlag = 0;
            EIQPDHKLQSKJHWFJK = 0;
        }
        else if (lagushkaASK == '7') {
            cout << "Тебе нужна Сила и БУМПАЛКА... \n";
        }
        else if (lagushkaASK == '8') {
            cout << "Тебе нужен ЯК-52 и СоТыЙ ЛеВоЛ (он у тебя уже есть, брат)... \n";
        }
        else  {
           exit(0);
        }
        
    }
    else if (q37 == 'y' && lvl <= 100) {
        cout << "Ты пока не достаточно мудр, говорит лягущь. Но я могу помочь тебе...\n";
        system("pause");
        cout << "Она касается вашего лба и вы чувствуете, чьто ваши мозги варят куда лучше, чем прежде... +69 к драгоценному жизненному опыту. \n";
        lvl = lvl + 69;
    }
    else if (q37 == 'n') {
        cout << "Иди своей дорогой странник...\n";
    }
    else {
        exit(0);
    }
}
void func36() {
    cout << "Вы видите Троцкого. Хотите зарубить его ледорубом? (y/n)\n";
    cin >> q36;
    if (q36 == 'y' && lvl < 30) {
        cout << "Вы случайно отрубили себе пятку и сКоНчАлИсЬ в страшных мучениях... \n";
        system("pause");
        exit(0);
    }
    else if (q36 == 'y' && lvl >= 30) {
        cout << "Вы зарубили Троцкого. Малаца. + 40 к драгоценному жизненному опыту. \n";
        lvl = lvl + 40;
    }
    else if (q36 == 'n') {
        cout << "Цыгане украли у вас коня и все деньги.\n";
        system("pause");
        cout << "Ненавижу блять цыган...\n";
        money = money - money;
    }
    else {
        exit(0);
    }
}
void func35() {
    cout << "Вас изнасилует огромная цельнометаллическая капибара. Это неизбежно. (y/n)\n";
    cin >> q35;
    if (q35 == 'y') {
        cout << "Вас изнасиловала огромная цельнометаллическая капибара\n";
    }
    else if (q35 == 'n') {
        cout << "Вас изнасиловала огромная цельнометаллическая капибара\n";
    }
    else {
        exit(0);
    }
}
void func34() {
    cout << "Вы зашли в Ижевск. Хотите pocker face? (y/n)\n";
    cin >> q34;
    if (q34 == 'y') {
        cout << "pocker face\n";
        system("pause");
        cout << "pocker face\n";
    }
    else if (q34 == 'n') {
        cout << "Ты не ржечьный, умри...\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func33() {
    cout << "Вы встретили обычную фиолетовую лягущь. Лягущь желает вам депрессии, смерти и отвала пиписьки\n";
    system("pause");
}
void func32() {
    cout << "Голос в темноте жОско ржот. Хотите по ржать вместе с ним? (y/n)\n";
    cin >> q32;
    if (q32 == 'y') {
        cout << "АХАХАХАХАХАХАХ\n";
    }
    else if (q32 == 'n') {
        cout << "Вы умерли от нержения.\n";
        system("pause");
    }
    else {
        exit(0);
    }
}
void func31() {
    cout << "Вы видите птенец-2. Хотите полетать? (y/n)\n";
    cin >> q31;
    if (q31 == 'y') {
        cout << "Вы полетали на  втором птенце. Вам хорошо.\n";
    }
    else if (q31 == 'n') {
        cout << "Вы умерли насмерть\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func30() {
    cout << "Гриффит пидор? (y/n)\n";
    cin >> q30;
    if (q30 == 'y') {
        cout << "Вашу руку и левый глаз откусил lobster. вы умерли от р ж е н и я... \n";
        system("pause");
        cout << "Вы видите высокого человека в чОрном, с Агромным мечем за спиной, с банкой кваса яхонт в правой руке и Ак-74 в левой руке \n";
        system("pause");
        cout << "Он протягивает вам руку и говорит: Nouse ylos, paskiainen. \n";
        system("pause");
        cout << "Вы снова живы.\n";
        cout << "Но на вашем члене появилась странная отметка...\n";

    }
    else if (q30 == 'n') {
        cout << "А может ты пидор, епта?\n";
    }
    else {
        exit(0);
    }
}
void func29() {
    cout << "Вы видите крапиву. Вы видите палку. Хуярить? (y/n)\n";
    cin >> q29;
    if (q29 == 'y') {
        cout << "Вы отхуярили себе левое яичко и умерли от кровопотери.\n";
        system("pause");
        exit(0);
    }
    else if (q29 == 'n') {
        cout << "Скажем дружно, нахуй нужно...\n";
    }
    else {
        exit(0);
    }
}
void func28() {
    cout << "Вы повстречали известного жида-торговца Егора Рабиновича. (если не хотите иметь с ним никаких дел, нажмите n) \n";
    cout << "Он показывает вам свои товары:\n";
    system("pause");
    cout << "1. Нерабочий тридэ принтер: 666 КГБ\n";
    cout << "2. БУМПАЛКА под 228 калибр: 228 КГБ\n";
    cout << "3. Сопла с али (наценка в 42 раза): 420 КГБ \n";
    cin >> q28;
    if (q28 == '1' && money >= 666) {
        cout << "Вы купили нерабочий тридэ принтер. Нахуя? \n";
        money = money - 666;
    }
    else if (q28 == '1' && money < 666) {
        cout << "У вас не хватает денег, чьтобы купить нерабочий тридэ принтер. Ну и ладно.\n";
        system("pause");
    }
    else if (q28 == '2' && money >= 228) {
        cout << "Вы купили БУМПАЛКУ.\n";
        boompalka = 1;
        money = money - 228;
    }
    else if (q28 == '2' && money < 228) {
        cout << "У вас не хватает денег, чьтобы купить БУМПАЛКУ. Кренге.\n";
        system("pause");
    }
    else if (q28 == '3' && money >= 420) {
        cout << "Вы купили сопла за 420 КГБ. Ебать вы лох. \n";
        money = money - 420;
    }
    else if (q28 == '3' && money < 420) {
        cout << "У вас не хватает денег, чьтобы купить сопла. Ну и ладно.\n";
        system("pause");
    }
    else if (q28 == 'n') {
        cout << "Лучше хуй засунуть в древо, чем иметь с Егором дело.\n";
    }
    else {
        exit(0);
    }
}
void func27() {
    cout << "Вы зашли в пещеру. \n";
    cout << "Вы видите огромный каменный фаллос. Вероятнее всего, это место поклонения местного первобытного племени. Хотите лизнуть фаллос? (y/n)\n";
    cin >> q27;
    if (q27 == 'y') {
        cout << "Как только вы лизнули огромный каменный фаллос вход в пещеру завалило, а сам фаллос стал ярко красного цвета. Тут же появились туземцы, в силовой броне с плазменными пушками на перевес. Внезапно, ваши стальные доспехи (и вас вместе с ними) притянуло огромным магнитом к потолку пещеры. Вперед вышел Главный туземец, надел VR шлем (скорее это был htc vive) и оттарабанил ваш шоколадный глаз огромным каменным членом. + 12 к драгоценному жизненному опыту \n";
        lvl = lvl + 12;
    }
    else if (q27 == 'n') {
        cout << "Разработчик, у тебя какие-то пидорские конкурсы, может ты пойдешь нахуй?\n";
    }
    else {
        exit(0);
    }
}
void func26() {
    cout << "Вы видите огромный аналоговый осциллограф с1-73. Хотите попросить у него благословение? (y/n)\n";
    cin >> q26;
    if (q26 == 'y') {
        cout << "Осциллограф дарует вам благословение и кусок пиццы с ананасами. Вы благодарны ему...\n";
        OscBlag = 1;
    }
    else if (q26 == 'n') {
        cout << "Вас оттарабанили в попенгаген культисты из секты любителей АНАЛоговых осциллографов. +9 к драгоценному жизненному опыту.\n";
        lvl = lvl + 9;
    }
    else {
        exit(0);
    }
}
void func25() {
    cout << "Вы видите быдло. Быдло продают постиронию. Хотите выкупить? (y/n)\n";
    cin >> q25;
    if (q25 == 'y') {
        cout << "Вы ВыКуПиЛи ПоСтИрОнИю\n";
        money = money - 1;
    }
    else if (q25 == 'n') {
        cout << "Вы НеВыКуПиЛи ПоСтИрОнИю\n";
    }
    else {
        exit(0);
    }
}
void func24() {
    cout << "Вы видите Леонида. Он торгует анашой. Один косяк - 42 ГКБ. Хотите купить косяк? (y/n)\n";
    cin >> q24;
    if (q24 == 'y') {
        cout << "Вы купили косяк и скурили его. Хотите купить ещё косяк? (y/n)\n";
        money = money - 42;
        cin >> anasha0;
        if (anasha0 == 'y') {
        cout << "Вы купили косяк и скурили его. Хотите купить ещё косяк? (y/n)\n";
        money = money - 42;
        cin >> anasha1;
        if (anasha1 == 'y') {
            cout << "Вы умерли от передоза.\n";
            system("pause");
            exit(0);

        }
        else if (anasha1 == 'n') {
            cout << "Правильно. Вы должны победить Дракона Энтропии, а не строчаться.\n";
        }

        }
        else if (anasha0 == 'n'){
            cout << "Правильно. Вы должны победить Дракона Энтропии, а не строчаться.\n";
        }
    }
    else if (q24 == 'n') {
        cout << "Вы убиваете Леонида, расчленяете его труп и сбрасываете его в Неву. Анашу вы не трогаете (наркотики зло) и она спокойно уходит в Саратов по трассе М17.\n";
    }
    else {
        exit(0);
    }
}
void func23() {
    cout << "Вы видите высокую гору, покрытую льдом.\n";
    system("pause");
    cout << "На горе написано Лева Лох\n";
    system("pause");
    cout << "Справебыдло\n";
    system("pause");
}
void func22() {
    cout << "Вы видите трусливого и подлого Бева Лелова. хотите убить, расчленить и сьесть его? (y/n)\n";
    cin >> q22;
    if (q22 == 'y') {
        cout << "Блять, ты ебанутый? Блять, какова хуя, сукаблять блять блять блять...\n";
    }
    else if (q22 == 'n') {
        cout << "Подлый и трусливый Бев Лелов всадил вам нож в спину. А чё вы ещё от него ожидали...\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func21() {
    cout << "Вас хочет изнасиловать жаба. Желаете сопротивляться? (y/n)\n";
    cin >> q21;
    if (q21 == 'y') {
        cout << " Вас не изнасиловала жаба...\n";
    }
    else if (q21 == 'n') {
        cout << "Вас изнасиловала жаба. + 5 к драгоценному жизненному опыту\n";
        lvl = lvl + 5;
    }
    else {
        exit(0);
    }
}
void func20() {
    cout << "Вы встретили Александра Невского. Хотите назвать все его титулы? (y/n)\n";
    cin >> q20;
    if (q20 == 'y') {
        cout << " Хоть это было и не просто, спустя 1337 часов вы назвали все титулы Александра Невского. За это Александр Невский даровал вам силу бога. Она вам точно поможет...\n";
        NePov = 1;
    }
    else if (q20 == 'n') {
        cout << "Микрофон передайте другому...\n";
    }
    else {
        exit(0);
    }
}
void func19() {
    cout << "Вы видите камень. Хотите его взять? (y/n)\n";
    cin >> q19;
    if (q19 == 'y') {
        cout << "ВЫ РАЗГНЕВАЛИ БОГОВ.\n";
        system("pause");
        cout << "Призрак коммунизма отпиздел богов и построил коммунизм в Саратове. Зачем? Хуй его знает...\n";

    }
    else if (q19 == 'n') {
        cout << "Да и хуй с ним. Да пошёл он нахуй. Сырники. \n";
    }
    else {
        exit(0);
    }
}
void func18() {
    cout << "Вы видите аналоговый осциллограф с1-94. Взять его с собой? (y/n)\n";
    cin >> q18;
    if (q18 == 'y') {
        cout << "Вы взяли осциллограф с1-94 с собой. + 94 к драгоценному жизненному опыту.\n";
        lvl = lvl + 94;
    }
    else if (q18 == 'n') {
        cout << "Олень порвал вашу прямую кишку своим членом.\n";
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func17() {
    cout << "Вы видите Корованы. Ограбить? (y/n)\n";
    cin >> q17;
    if (q17 == 'y') {
        cout << "Вы ограбили корованы, получив + 228 ГКБ и + 34 к драгоценному жизненному опыту.\n";
        money = money + 228;
        lvl = lvl + 34;
    }
    else if (q17 == 'n') {
        cout << "Чювак, ты исключен из лиги ржечных преколистов, умри.\n";
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func16() {
    cout << "Вы видите крутую лягущьку в красной кепке. Хотите пожелать ей хорошего вечера? (y/n)\n";
    cin >> q16;
    if (q16 == 'y') {
        cout << "Лягущька в крутой красной кепке оказалась приверженцем концепции фрейдизма-лаканизма и определила вас в пидорасы.\n";
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else if (q16 == 'n') {
        cout << "Вот и правильно, ну и хуй с ней.\n";
    }
    else {
        exit(0);
    }
}
void func15() {
    cout << "Вы видите... блять что это (y/n)\n";
    cin >> q15;
    if (q15 == 'y') {
        cout << "Вас изнасиловал конь\n";
        cout << "Вы умерли насмерть.\n";
        system("pause");
        exit(0);
    }
    else if (q15 == 'n') {
        cout << "...\n";
        cout << "Ну и слава Б-гу\n";
        lvl = lvl + 1;
    }
    else {
        exit(0);
    }
}
void func14() {
    cout << "Вы видите два стула, один с пиками точёными, другой с радиоактивными хуями модели УЭЗ-46. Хотите сесть на стул с хуями? (y/n)\n";
    cin >> q14;
    if (q14 == 'y') {
        cout << "Вы восстановили силы и обрели душевное спокойствие\n";
    }
    else if (q14 == 'n') {
        cout << "Вы устали насмерть\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func13() {
    cout << "Бинауарный бегемот просит достать ему glaza из ПрУдА (Они polzut). Достать glaza? (y/n)\n";
    cin >> q13;
    if (q13 == 'y') {
        cout << "Вы получили 666 ГКБ\n";
        money = money + 666;
    }
    else if (q13 == 'n') {
        cout << "Вы оbre4enы\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func12() {
    cout << "Вы зашли в губернский город N. Хотите убить, расчленить и изнасиловать всех жителей города? (y/n)\n";
    cin >> q12;
    if (q12 == 'y') {
        cout << "Ты чё, ебанутый? Пошел нахуй из игры, маньяк ёбаный\n";
        system("pause");
        exit(0);
    }
    else if (q12 == 'n' && money >= 69) {
        cout << "Вас объегорили на 69 ГКБ\n";
        money = money - 69;
    }
    else if (q12 == 'n' && money < 69) {
        cout << "У вас отняли всё чьто было и отымели в сраку (чут-чут).\n";
        money = money - money;
    }
    else {
        exit(0);
    }
}
void func11() {
    cout << "Вы повстречали продавца спектрумов. Он предлагает купить у него 3.5 дюймовый дисковод для вашей спеки за 350 ГКБ (y/n)\n";
    cin >> q11;
    if (q11 == 'y' && money >= 350) {
        cout << "Вы счастливы\n";
        money = money - 350;
    }
    else if (q11 == 'y' && money < 350) {
        cout << "У вас не хватает денег, чьтобы купить 3.5 дюймовый дисковод. Обидно.\n";
    }
    else if (q11 == 'n') {
        cout << "Ты латентный гомосексуалист, вопросы?\n";
    }
    else {
        exit(0);
    }
}
void func10() {
    cout << "Хотите совершить сомоубийство? (y/n)\n";
    cin >> q10;
    if (q10 == 'y') {
        cout << "Убив сома, вы прокачали интеллект и жОско по ржали. + 4 к драгоценному жизненному опыту.\n";
        lvl = lvl + 4;
    }
    else if (q10 == 'n') {
        cout << "Вот и правильно, ведь жизнь так прекрасна... \n";
    }
    else {
        exit(0);
    }
}
void func9() {
    cout << "ВСТАВАЙ ПРОКЛЯТЬЕМ ЗАКЛЕЙМЕННЫЙ... хотите встать? (y/n)\n";
    cin >> q9;
    if (q9 == 'y') {
        cout << "Ты блять рыцарь, какой нахуй проклятьем заклейменный??? ты ебанулся нахуй?\n";
    }
    else if (q9 == 'n') {
        cout << "Веселая нарезка черни.\n";
    }
    else {
        exit(0);
    }
}
void func8() {
    cout << "Вы видите сусемьбэ))). Хотите полетать? (y/n)\n";
    cin >> q8;
    if (q8 == 'y') {
        cout << "у вас украли четверть денег и отрезали хуй\n";
        money = money - money * 0.25;
        system("pause");
        cout << "Вас ограбили калькуляторы ебать, пиздец...\n";
    }
    else if (q8 == 'n') {
        cout << "у вас украли половину денег и отрезали хуй\n";
        money = money - money / 2;
    }
    else {
        exit(0);
    }
}
void func7() {
    cout << "Вы нашли зажигалку. Хотите поджечь себя? (y/n)\n";
    cin >> q7;
    if (q7 == 'y') {
        cout << "Зажигалка превратилась в 8-дюймовый пенис, который оттарабанил вас в сраку. После этого пенис молча достал зажигалку и закурил кубинскую сигару. +5 к драгоценному жизненному опыту.\n";
        lvl = lvl + 5;
    }
    else if (q7 == 'n') {
        cout << "Чювак, чьто с тобой не так? Ты нормальный вообще? Сходи проверься к мозгоправу, попей колесики.\n";
        system("pause");
        exit(0);
    }
    else {
        exit(0);
    }
}
void func6() {
    cout << "На грунтовой дороге лежит головка сыра. Хотите поднять его? (y/n)\n";
    cin >> q6;
    if (q6 == 'y') {
        cout << "Вас продали в рабство жыдорептилоидам\n";
        system("pause");
        exit(0);
    }
    else if (q6 == 'n') {
        cout << "Вы ознакомились с содержанием постановления ЦИК СССР и СНК СССР от 7 августа 1932 года «Об охране имущества государственных предприятий, колхозов и кооперации и укреплении общественной (социалистической) собственности»\n";
    }
    else {
        exit(0);
    }
}
void func5() {
    cout << "Ты пидор? (y/n)\n";
    cin >> q5;
    if (q5 == 'y') {
        cout << "Ну ты и пидор...\n";
        cout << "Ну ты и пидор...\n";
        cout << "Ну ты и пидор...\n";
    }
    else if (q5 == 'n') {
        cout << "Овца дала вам 5 денег.\n";
        money = money + 5;
    }
    else {
        exit(0);
    }
}
void func4() {
    cout << "Вы зашли в густой хвойный лес.\n";
    cout << "Вы видите волка. Хотите убить его и повысить свой уровень? (y/n)\n";
    cin >> q4;
    if (q4 == 'y') {
        cout << "Вы убили волка и повысили свой уровень. +1 к драгоценному жизненному опыту.\n";
        lvl = lvl + 1;
    }
    else if (q4 == 'n') {
        cout << "Вы не убили волка и не повысили свой уровень. Однако, в лесу вы нашли небольшое красное яйцо с глазами и продали в ближайшем городе на базаре. +120 ГКБ.\n";
        money = money + 120;
    }
    else {
        exit(0);
    }
}
void func3() {
    cout << " К вам подходит Владимир Ильич Ленин и предлагает стать лягущькой. Хотите стать лягущькой? (y/n)\n";
    cin >> q3;
    if (q3 == 'y') {
        cout << "Вы стали лягущькой. Игра окончена\n";
        system("pause");
        cout << "Это оффицальная концовка игры, вопросы?\n";
        system("pause");
        exit(0);
    }
    else if (q3 == 'n') {
        cout << "Вас раскулачили.\n";
        money = money - money;
    }
    else {
        exit(0);
    }
}
void func2() {
    cout << "Выключить игру (y/n)\n";
    cin >> q2;
    if (q2 == 'y') {
        cout << "Ну и правильно...\n";
        system("pause");
        exit(0);
    }
    else if (q2 == 'n') {
        cout << "Ебать ты... ну ладно, продолжай играть, мразь ебаная\n";
    }
    else {
        exit(0);
    }
}
void func1() {
    cout << "Вы зашли в таверну Гарцующий Лошедь. Хотите выпить пинту рома? (y/n)\n";
    cin >> q1;
    if (q1 == 'y') {
        cout << "Вы умерли от алкогольной интоксикации\n";
        system("pause");
        cout << "Вас воскресил призрак коммунизма. Зачем? Хуй его знает...\n";
        system("pause");
    }
    else if (q1 == 'n') {
        cout << "Правильно, алкоголь - зло.\n";
        system("pause");
        cout << "Пьяные алкаши обоссали вас в подворотне и сказали что вы пидор. + 1 к жизненному опыту.\n";
        lvl = lvl + 1;
    }
    else {
        exit(0);
    }
}
void func0() {
    cout << "Вы встретили очень редкую голубую лягущь. Лягущь желает вам счастья, здоровья и успехов в личной жизни\n";
    system("pause");
}

int main() {
    srand(time(NULL)); //хз чьто это, скопипастил из интернет.
    setlocale(LC_ALL, "Russian"); //яРУСССКИЙ
    system("color 02"); //хайповый зеленый цвет
    

    cout << "███        ███\n";
    cout << "████        ███      ██████\n";
    cout << "██████       ███     ██    █████    ██████                       ███████    ████████\n";
    cout << "██  ██        ██    ███             ████████       █████        ███  ████  ████   ███    ████████\n";
    cout << "███  ███       ██    ██              ███   ███    ████ ████      ██    ███  ██      ██  ████\n";
    cout << "███   ███     ███    ██              ███    ███  ████     ███     ██   ███   ██     ███ ██\n";
    cout << "███   ███    ███    ████            ███      ██ ███        ███    ███████    █████████  ███\n";
    cout << "██     ███   ███   ██████████       ███      ██ ██          ███   ████       ██         ██   ██████\n";
    cout << "██      ███  ██    ███             ███       ██ ██           ███  ██████     ██         ██       ███\n";
    cout << "██       ██████    ██              ██        ██ ██            ███ ██  ████   ██         ██        ██\n";
    cout << "██        █████    ██              ██       ███ ██           ████ ███   ███  ██         ████   █████\n";
    cout << "██        ████     ███            ██   ███████  ██          ███    ██    ██  ██           ███████\n";
    cout << "██         ██      ███████        ████████       █████████████     ██\n";
    cout << "█████    ███             ███████\n";
        
    cout << "Вы - храбрый и доблестный рыцарь Лев Белов (не путать с трусливым и подлым Бевом Леловым), который отправился в свое последнее путешествие, чтьобы спасти свой мир от ужасного Дракона Энтропии. На своем пути вам встретятся... ржечька, пре колы, корованы и прочие ужасы постмодерна\n";
    cout << "Удачи...";

    system("pause"); //системная пауза

    int A = 0;  //переменная для рандома
    int B = 68; //переменная для рандома
    int X = 0;  //переменная для рандома

    int i; 
    int sum = 0; 
    for (i = 1; i <= 69; i++) //цикл для рандомного рандома
    {
        sum = sum + i;
       X = A + rand() % ((B + 1) - A); //формула рандомного рандома

       if (X == 68) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func68();
           cout << "------------------------------\n";
       }
       else if (X == 67) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func67();
           cout << "------------------------------\n";
       }
       else if (X == 66) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func66();
           cout << "------------------------------\n";
       }
       else if (X == 65) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func65();
           cout << "------------------------------\n";
       }
       else if (X == 64) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func64();
           cout << "------------------------------\n";
       }
       else if (X == 63) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func63();
           cout << "------------------------------\n";
       }
       else if (X == 62) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func62();
           cout << "------------------------------\n";
       }
       else if (X == 61) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func61();
           cout << "------------------------------\n";
       }
       else if (X == 60) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func60();
           cout << "------------------------------\n";
       }
       else if (X == 59) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func59();
           cout << "------------------------------\n";
       }
       else if (X == 58) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func58();
           cout << "------------------------------\n";
       }
       else if (X == 57) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func57();
           cout << "------------------------------\n";
       }
       else if (X == 56) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func56();
           cout << "------------------------------\n";
       }
       else if (X == 55) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func55();
           cout << "------------------------------\n";
       }
       else if (X == 54) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func54();
           cout << "------------------------------\n";
       }
       else if (X == 53) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func53();
           cout << "------------------------------\n";
       }
       else if (X == 52) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func52();
           cout << "------------------------------\n";
           
       }
        else if (X == 51) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func51();
           cout << "------------------------------\n";
       }
       else if (X == 50) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func50();
           cout << "------------------------------\n";
           }
       else if (X == 49) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func49();
           cout << "------------------------------\n";
           }
       else if (X == 48) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func48();
           cout << "------------------------------\n";
           }
        else if (X == 47) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func47();
           cout << "------------------------------\n";
       }
       else if (X == 46) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func46();
           cout << "------------------------------\n";
       }
       else if (X == 45) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func45();
           cout << "------------------------------\n";
       }
       else if (X == 44) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func44();
           cout << "------------------------------\n";
       }
       else if (X == 43) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func43();
           cout << "------------------------------\n";
       }
       else if (X == 42) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func42();
           cout << "------------------------------\n";
       }
       else if (X == 41) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func41();
           cout << "------------------------------\n";
       }
       else if (X == 40) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func40();
           cout << "------------------------------\n";
       }
       else if (X == 39) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func39();
           cout << "------------------------------\n";
       }
       else if (X == 38) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func38();
           cout << "------------------------------\n";
       }
       else if (X == 37) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func37();
           cout << "------------------------------\n";
       }
       else if (X == 36) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func36();
           cout << "------------------------------\n";
       }
       else if (X == 35) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func35();
           cout << "------------------------------\n";
       }
       else if (X == 34) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func34();
           cout << "------------------------------\n";
       }
       else if (X == 33) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func33();
           cout << "------------------------------\n";
           
       }
       else if (X == 32) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func32();
           cout << "------------------------------\n";
       }
       else if (X == 31) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func31();
           cout << "------------------------------\n";
       }
       else if (X == 30) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func30();
           cout << "------------------------------\n";
       }
       else if (X == 29) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func29();
           cout << "------------------------------\n";
       }
       else if (X == 28) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func28();
           cout << "------------------------------\n";
       }
        else if (X == 27) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func27();
           cout << "------------------------------\n";
       }
       else if (X == 26) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func26();
           cout << "------------------------------\n";
       }
       else if (X == 25) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func25();
           cout << "------------------------------\n";
       }
       else if (X == 24) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func24();
           cout << "------------------------------\n";
       }
       else if (X == 23) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func23();
           cout << "------------------------------\n";
       }
        else if (X == 22) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func22();
           cout << "------------------------------\n";
       }
       else if (X == 21) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func21();
           cout << "------------------------------\n";
       }
       else if (X == 20) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func20();
           cout << "------------------------------\n";
       }
       else if (X == 19) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func19();
           cout << "------------------------------\n";
       }
       else if (X == 18) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func18();
           cout << "------------------------------\n";
       }
       else if (X == 17) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func17();
           cout << "------------------------------\n";
       }
       else if (X == 16) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func16();
           cout << "------------------------------\n";
       }
       else if (X == 15) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func15();
           cout << "------------------------------\n";
       }
       else if (X == 14) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func14();
           cout << "------------------------------\n";
       }
       else if (X == 13) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func13();
           cout << "------------------------------\n";
       }
       else if (X == 12) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func12();
           cout << "------------------------------\n";
       }
       else if (X == 11) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func11();
           cout << "------------------------------\n";
       }
       else if (X == 10) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func10();
           cout << "------------------------------\n";
       }
       else if (X == 9) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func9();
           cout << "------------------------------\n";
       }
       else if (X == 8) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func8();
           cout << "------------------------------\n";
       }
       else if (X == 7) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func7();
           cout << "------------------------------\n";
       }
       else if (X == 6) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func6();
           cout << "------------------------------\n";
       }
       else if (X == 5) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func5();
           cout << "------------------------------\n";
       }
       else if (X == 4) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func4();
           cout << "------------------------------\n";
       }
       else if (X == 3) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func3();
           cout << "------------------------------\n";
       }
       else if (X == 2) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func2();
           cout << "------------------------------\n";
       }
       else if (X == 1) {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func1();
           cout << "------------------------------\n";
       }
       else {
           cout << "Грязные капиталистические бумажки = ";
           cout << money << endl;
           cout << "Ваш драгоценный жизненный опыт = ";
           cout << lvl << endl;
           func0();
           cout << "------------------------------\n";
           
       }
      
    }

    cout << "Вы видите Дракона Энтропии. Он похож на пенис. Почему? Хуй его знает, наверное всё так и должно быть. Пути постмодерна как правило крайне дегенеративны, но очень ржечны.\n ";
    system("pause");

    if (EIQPDHKLQSKJHWFJK == 0) {
        cout << "Вы прошли игру на секретную концовку. Нахуя вы это сделали? В этой концовке нет смысла. Прям вообще. Она бесполезна. Идите умрите нахуй. Я серьёзно, вы не нужны человечеству. Вы говно и мразь. Ебаное быдло. Если вы умрете, то всем станет только лучше...";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && OscBlag == 1 && boompalka == 1 && NePov == 1) {
        cout << "С помощью силы Невского, благословения аналогового осциллографа с1-73 и БУМПАЛКИ, вы настолько сильно отпердолили в попенгаген Дракона Энтропии, чьто его прямая кишка не выдержала и порвалась на 42 куска.\n";
        cout << "Все эти 42 куска вы расстреляли из бумпалки, уничножив тем самым существующую реальбность и создав новую, реальбность победившего коммунизма. Это хорошая концовка.\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && boompalka == 1 && NePov == 1) {
        cout << "С помощью силы Невского и БУМПАЛКИ оттрахали в попенгаген Дракона Энтропии. Реальбность жмыхнулась, разжмыхнулась и вы отымели Айн Ренд в сракотан.\n";
        cout << "Серьёзно, (Атлант расправил плечи) - ебаное говно. Дохуя воды, нихуя смысла. Айн Ренд идет нахуй. Конец.\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && OscBlag == 1 && boompalka == 1) {
        cout << "Дракон Энтропии поглотил вас, но в самый последний момент вы успели нажать на курок БУМПАЛКИ и уничтожили его член изнутри.\n ";
        cout << "Хоть вы и погибли, Дракон Энтропии больше не сможет ебать вселенную и ваш поступок будет жить вечно...\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && OscBlag == 1 && NePov == 1) {
        cout << "С помощью силы Невского и благословения аналогового осциллографа с1-73 вы отпердолили в шоколадный глаз Дракона Энтропии, чьто привело к жОскому ржению планетариата во всех точках пространства и времени.\n";
        cout << "Ржение достигло такой силы, чьто вы смогли записать себя в четырехмерное пространство реальбности и стать хайповым четыредэ врыбовым. Конец.\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && NePov == 0) {
        cout << "Дракон Энтропии поглотил вас и всю материальную вселенную. Ничего страшного, но теперь все мертвы..." << endl;
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && OscBlag == 1) {
        cout << "Дракон Энтропии поглотил вас и всю материальную вселенную. Ничего страшного, но теперь все мертвы...\n ";
        cout << "Кажется, вам нужно было что-то ещё...\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && boompalka == 1) {
        cout << "Дракон Энтропии поглотил вас и всю материальную вселенную. Ничего страшного, но теперь все мертвы...\n ";
        cout << "Кажется, вам нужно было что-то ещё...\n ";
    }
    else if (EIQPDHKLQSKJHWFJK == 1 && NePov == 1) {
        cout << "С помощью силы Невского вы отпердолили в сракотан Дракона Энтропии, чьто привело к Большому разжмыху вселенной и всеобщему ржению.\n";
        cout << "Правда даже это не спасло вас от смерти, но вы хотябы по ржали на последок.\n ";
    } 
    system("pause");
    cout << "Лягущька\n ";
    system("pause");
    return 0;
}
//Лева лох
//Лева лох
//Лева лох

//Внимание анекдот:
/*Поспорили управляющие Нью—Йоркского и Московского Диснейлендов, чья комната страха страшнее. Зашел, значит, управляющий Московского в их комнату:
  скелеты всякие, привидения — в общем, ничего интересного.
  Заходит теперь американец к нам, видит: длиннющий темный коридор, а в самом конце грузин на корточках сидит, в руке держит горящую свечку.
  Грузин:
  — Попа мыл?
  — Мыл.
  Грузин молча тушит свечку...
*/
